OpenFOAM-6-AP/tutorials/compressible/rhoCentralFoam/shockTube/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;

sets
(
    line
    {
        type    lineFace;
        axis    x;
        start   (-5 0 0);
        end     (5 0 0);
        nPoints 100;
    }
);

fields          ( p U.component(0) T rho );


// ************************************************************************* //
